import json

author = 'ДОЦ. Д-Р ЮЛИАНА ПЕНЕВА'
theme = 'Databases1'


lets = ['А', 'Б', 'В', 'Г']

def add_question(author,
                 theme,
                 question_level,
                 question,
                 choices,
                 author_thumbnail=None):

    file = f'C:/ABC/CODING/#CRAFTING/Stani-Bogat/data/questions/{theme}/{str(question_level).zfill(2)}/questions.json'

    with open(file, 'r', encoding='utf-8') as f:
        data = json.load(f)

    if author not in data.keys():
        print('IN')
        data[author] = {
                    "questions": list()
                    }

    if author_thumbnail:
        data[author]['author_img'] = author_thumbnail

    data[author]['questions'].append(dict(question=question,
                                          choices=choices))

    with open(file, 'w', encoding='utf-8') as f:
        json.dump(data, f, ensure_ascii=False)


def fill(text):
    level = 1
    count = 0
    question = str()
    choices = list()

    print(text.split('\n'))
    for line in text.split('\n'):
        if count == 0:
            question = ' '.join(line.split()[2:])
        elif count in [1, 2, 3, 4]:
            print(line)
            choices.append(line.split(')')[1])
        elif line:
            index = lets.index(line[0])
            if index != 0:
                choices[0], choices[index] = choices[index], choices[0]

            add_question(author,
                         theme,
                         level,
                         question,
                         choices)
            level += 1
            count = -1
            choices = list()
        count += 1


fill(
    """Въпрос 7: Състояние на базата от данни се нарича:
а)данните в базата във всеки един момент от време;
б)речникът на базата;
в)описанието на базата;
г)структурата на файловете й.
А
Въпрос 10: За състояние и схема на базата е вярно:
а)на дадена схема съответства едно състояние;
б)на дадена схема съответстват много състояния;
в)състоянието на базата не се променя;
г)при въвеждане на нов елемент в базата се променя схемата.
Б
Въпрос 16: Езикът, чрез който се дефинира схемата на базата се нарича:
а)език за обработка на данните;
б)език за дефиниране на структурите;
в)език за дефиниране на данните;
г)език за дефиниране на потребителските представи.
В
Въпрос 18: Състояние на базата се нарича:
а)нейната дефиниция;
б)нейната схема;
в)конкретните данни в нея;
г)базата, СУБД и приложенията.
В
Въпрос 6: Схема на базата от данни е:
а)данните, които се съхраняват в нея;
б)описание на базата от  данни;
в)набор от файлове, в които се съхраняват данните;
г)нейния речник.
Б
Въпрос 24 Данните в базата във всеки един момент от време се наричат:
а)схема на базата;
б)състояние на базата;
в)модел на данни от ниско ниво;
г)физически модел на данни.
Б
Въпрос 5: Модел на данните е:
а)средство за описание на базата и операциите върху нея;
б)средство за обработка на базите от данни;
в)набор от операции върху данните;
г)начин на представяне на информацията във вид удобен за потребителя.
А
Въпрос 13: Логическа независимост на данните означава:
а)възможност да се променя концептуалната схема без да се налагат промени във външната схема или приложните програми;
б)възможност да се променя вътрешната схема без това да води до промени в концептуалната или външната схема;
в)възможност да се променя външната схема без това да води до промени в концептуалната или вътрешната схема;
г)невъзможност за промени в схемите.
А
Въпрос 19: Физическа независимост на данните означава:
а)възможност да се променя концептуалната схема без да се налагат промени във външната схема или приложните програми;
б)възможност да се променя вътрешната схема без това да води до промени в концептуалната или външната схема;
в)възможност да се променя външната схема без това да води до промени в концептуалната или вътрешната схема ;
г)невъзможност за промени в схемите.
Б
Въпрос 12: При всяко обновяване на данните:
а)се задава съответна нова схема;
б)се получава съответно ново състояние на базата;
в)схемата и състоянието не се променят;
г)нито едно от изброените по-горе.
Б
Въпрос 8: Моделите на данните биват:
а)обектни и релационни;
б)релационни, мрежови, йерархични;
в)класически, обектни, физически;
г)семантични, мрежови, релационни
В
Въпрос 9: За схемата на базата е вярно:
а)задава описанието на базата;
б)не е относително постоянна във времето;
в)определя се при реализацията на базата;
г)нито едно от изброените.
А
Въпрос 4: Концептуалната схема дефинира:
а)представата за базата на отделна потребителска група;
б)физическата структура на съхранение на базата от данни;
в)глобалната структура на базата без детайлите на физическото й съхранение;
г)таблиците, индексните файлове, полетата и записите.
Б
Въпрос 7: Състояние на базата от данни се нарича:
а)данните в базата във всеки един момент от време;
б)речникът на базата;
в)описанието на базата;
г)структурата на файловете й.
А
Въпрос 10: За състояние и схема на базата е вярно:
а)на дадена схема съответства едно състояние;
б)на дадена схема съответстват много състояния;
в)състоянието на базата не се променя;
г)при въвеждане на нов елемент в базата се променя схемата.
Б"""
)