import json

author = 'ДОЦ. Д-Р ЮЛИАНА ПЕНЕВА'
theme = 'Information systems'


lets = ['a', 'b', 'c', 'd']

def add_question(author,
                 theme,
                 question_level,
                 question,
                 choices,
                 author_thumbnail=None):

    file = f'C:/ABC/CODING/#CRAFTING/Stani-Bogat/data/questions/{theme}/{str(question_level).zfill(2)}/questions.json'

    with open(file, 'r', encoding='utf-8') as f:
        data = json.load(f)

    if author not in data.keys():
        print('IN')
        data[author] = {
                    "questions": list()
                    }

    if author_thumbnail:
        data[author]['author_img'] = author_thumbnail

    data[author]['questions'].append(dict(question=question,
                                          choices=choices))

    with open(file, 'w', encoding='utf-8') as f:
        json.dump(data, f, ensure_ascii=False)


def fill(text):
    level = 1
    count = 0
    question = str()
    choices = list()

    print(text.split('\n'))
    for line in text.split('\n'):
        if count == 0:
            question = line
        elif count in [1, 2, 3, 4]:
            # print(line)
            choices.append(line[3:])
        elif line:
            index = lets.index(line[0])
            if index != 0:
                choices[0], choices[index] = choices[index], choices[0]


            print(level, question, choices)
            add_question(author,
                         theme,
                         level,
                         question,
                         choices)
            level += 1
            count = -1
            choices = list()
        count += 1


fill("""Посочете операцията за обединяване на многомерни данни:
a. SELECT
b. ROLL-UP
c. Pivot
d. AGREGATE
b
Информационната система е:
a. може да се разглежда като база от данни
b. специален тип бизнес система
c. бизнес процес
d. и трите са верни
b
Системите, подпомагащи вземането на решения обслужват :
a. тактическото ниво на управление
b. оперативното ниво на управление
c. цялата организация
d. стратегическото ниво на управление
a
Системите, обработващи транзакции обслужват :
a. стратегическото ниво на управление
b. цялата организация
c. оперативното ниво на управление
d. тактическото ниво на управление
c""")




# """Администраторът на базата:
# a. определя правата за достъп на потребителите
# b. реализира проектирани вече приложения
# c. извлича и обновява данни
# d. няма точен отговор
# a
# Трета нормална форма забранява:
# a. сложни атрибути
# b. транзитивни функционални зависимости
# c. пълни функционални зависимости
# d. друго
# b
# Релационната схема е във втора нормална форма ако:
# a. има само два ключа
# b. е в първа нормална форма и няма частични зависимости
# c. домейните на всички атрибути са атомарни
# d. няма верен отговор
# b
# Първа нормална форма забранява:
# a. множество от стойности
# b. кортеж от стойности
# c. влагане на релации
# d. и трите са верни
# d
# При директните файлове местоположението на записа се изчислява чрез:
# a. сортиране
# b. хеширане
# c. индексиране
# d. потребителска програма
# b
# Модел на данните е:
# a. средство за описание на базата и операциите върху нея
# b. средство за обработка на базите от данни
# c. набор от операции върху данните
# d. начин на представяне на информацията във вид удобен за потребителя
# a
# Нормализацията на данните се извършва:
# a. да се избегнат аномалии при въвеждане и изтриване
# b. да се избегнат аномалии при обновяване на данните
# c. да се избегне излишество в данните
# d. и трите са верни
# d
# Релационните операции са:
# a. селекция, проекция, съединение, деление
# b. филтриране, декартово произведение, обединение
# c. композиция, съединение, селекция
# d. други
# a
# Посочете независимите от СУБД фази при проектирането на база от данни:
# a. всички фази са независими от избраната СУБД
# b. анализ на изискванията и концептуално проектиране
# c. всички фази зависят от избраната СУБД
# d. проектиране на логическата и физическата база
# b
# Състояние на базата от данни се нарича:
# a. данните в базата във всеки един момент от време
# b. речникът на базата
# c. описанието на базата
# d. структурата на файловете й
# a
# Езикът за дефиниране схемата на базата се нарича:
# a. език за обработка на данните
# b. език за дефиниране на структурите
# c. език за дефиниране на данните
# d. език за дефиниране на потребителските представи
# c
# Релационната схема може да:
# a. има няколко кандидат ключа
# b. има няколко главни ключа
# c. няма ключ
# d. няма верен отговор
# a
# E-R моделът служи за :
# a. проектиране схемата на базата
# b. проектиране на приложенията
# c. реализация на базата
# d. и трите са верни
# a
# В E-R модела съставният атрибут:
# a. е изграден от други атрибути с независимо значение
# b. притежава множество от стойности
# c. се изчислява
# d. няма верен отговор
# a
# Посочете верното твърдение:
# a. на дадена схема съответства едно състояние
# b. на дадена схема съответстват много състояния
# c. състоянието на базата не се променя
# d. при въвеждане на нов елемент в базата се променя схемата
# b"""