import json

author = 'ДОЦ. Д-Р ЯСЕН ВЛАДИМИРОВ ГОРБУНОВ'
theme = 'Computer Architectures'


lets = ['А', 'Б', 'В', 'Г']

def add_question(author,
                 theme,
                 question_level,
                 question,
                 choices,
                 author_thumbnail=None):

    file = f'C:/ABC/CODING/#CRAFTING/Stani-Bogat/data/questions/{theme}/{str(question_level).zfill(2)}/questions.json'

    with open(file, 'r', encoding='utf-8') as f:
        data = json.load(f)

    if author not in data.keys():
        print('IN')
        data[author] = {
                    "questions": list()
                    }

    if author_thumbnail:
        data[author]['author_img'] = author_thumbnail

    data[author]['questions'].append(dict(question=question,
                                          choices=choices))

    with open(file, 'w', encoding='utf-8') as f:
        json.dump(data, f, ensure_ascii=False)


def fill(text):
    level = 1
    count = 0
    question = str()
    choices = list()

    print(text.split('\n'))
    for line in text.split('\n'):
        if count == 0:
            question = ' '.join(line.split()[1:])
        elif count in [1, 2, 3, 4]:
            print(line)
            choices.append(line.split(')')[1])
        elif line:
            index = lets.index(line[0])
            if index != 0:
                choices[0], choices[index] = choices[index], choices[0]

            print(level, question, choices)
            add_question(author,
                         theme,
                         level,
                         question,
                         choices)
            level += 1
            count = -1
            choices = list()
        count += 1


fill("""1. За архитектурата Harvard НЕ е вярно:
А) притежава обща памет за съхраняване на програми и данни
Б) притежава два контролера за управление на паметта
В) може да извлича паралелно команди и данни
Г) всички изброени
А
2. Според дефиницията на IEEE организацията на компютърната архитектура включва няколко нива на абстракция, подредени в следния нарастващ ред:
А) архитектура, микроархитектура, цифрови логически схеми, асемблер, езици от високо ниво
Б) транзистори, цифрови логически схеми, микроархитектура, архитектура, машинен интерфейс, асемблер, езици от високо ниво
В) цифрови логически схеми, обкръжения, компилатори и файлови системи, операционна система, асемблерен език
Г) всички изброени
А
3. Регистрите на процесора представляват малка, но бърза памет, изградена от тригери. За тях НЕ е вярно:
А) представляват последователностни логически схеми
Б) включват регистри за данни, адресни и флагови регистри, регистри за интрукции
В) данните в тях се четат и записват винаги паралелно
Г) за някои регистри е възможен побитов достъп до данни
В
4. За стековата памет НЕ е вярно:
А) представлява временна памет за използване при преход към подпрограма или функция, с цел осигуряване на възможност за връщане към следваща инструкция, когато процедурата завърши
Б) буферна памет тип LIFO
В) буферна памет за временно съхранение от тип FIFO
Г) използва за достъп две основни инструкции – push и pop
В
5. Стражевият таймер НЕ може да се използва за:
А) генериране на прекъсване при работа с външни устройства
Б) измерване на времеви интервали
В) генериране на прекъсване, водещо до рестартиране на микроконтролера
Г) всички изброени
А
6. Информацията, която се съхранява в регистъра на инструкцията (IR), се отнася до:
А) адреса на следващата инструкция, която трябва да бъде извлечена
Б) следващото поле, в което ще се прави запис на данни или полето, от което ще се чете
В) последната извлечена от паметта инструкция, която следва да бъде изпълнена
Г) всички изброени
А
7. Основните стъпки при изпълнение на инструкция се наричат машинен цикъл. Кои са те?
А) fetch, decode, execute
Б) start, run, close
В) boot, load, run
Г) start, restart, shutdown
А
8. За архитектурите с предварителна подготовка на данните (конвейер, pipeline) НЕ е вярно:
А) подготовката на следващата инструкция се извършва, докато се изпълнява текущата
Б) цикълът на конвейера се определя от времетраенето на най-бавната фаза
В) структурата е асинхронна, а времената за обработка на всяка фаза са различни и възможно най-кратки
Г) всички изброени
В
9. Концепцията за използване на нишки представлява:
А) концепция за постигане на паралелизъм на ниво инструкции, при която данните винаги са налични в кеша
Б) разделяне на физическия процесор на логически процесори, видими за операционната система и споделяне на натоварването между тях
В) разширяване на разрядността на системната шина, с цел формиране на канали, наречени нишки, с чиято помощ да се увеличи бързодействието
Г) всички изброени
Б
10. Таксономията на Флин представлява:
А) вид архитектура на микропроцесора
Б) разделяне на физическия процесор на логически процесори, видими за операционната система и споделяне на натоварването между тях
В) йерархична класификация на паметта в микрокомпютъра
Г) класификация на микрокомпютрите според броя ядра и нишки
В
11. В таксономията на Флин MIMD структурата е свързана с:
А) традиционен компютър с архитектура Von Neumann
Б) конвейнерни и систолични процесори
В) векторни и матрични процесори
Г) многопроцесорни системи, обработващи мноцество потоци от данни, водещи до паралелизъм в изпълнението на програми
Г
12. При директния достъп до паметта (DMA):
А) Процесора е свободен от извършване на трансфер на данни
Б) не се използва системата за генериране на прекъсвания 
В) Процесора е свободен от разрешаване на трансфера на данни, не указва активното устройство и не определя началния адрес на паметта при предаване на данни
Г) всички изброени
А""")