questions = {
    "1": {"На колко години става пълнолетен в България?": ["18", "21", "25", "16"]},
    "2": {"Как продължава стихотворението \"Аз съм българче, обичам...\"?": ["нашите планини зелени", "българин да се наричам", "българче да се наричам", "Горда Стара планина"]},
    "3": {"Как продължава куплета от песента \"Боят настана, тупат сърца ни...\"?": ["ето ги, близо, нашите душмани", "ето ги, близо, лошите душнани", "ето ги, идват, нашите душмани", "ето, Симеон пристига, воеводите зове"]},
    "4": {"Приблизително колко километра са 15 американски мили?": ["25", "18", "22", "20"]},
    "5": {"Какво показва октановото число?": ["ефективността на бензина", "токсичността на бензина", "цената на бензина", "плътността на безнина"]},
    "6": {"Какво е комодския варан?": ["гушер", "паяк", "птица", "риба"]},
    "7": {"С кой кораб американците Нийл Армстронг и Едуин Олдрин кацат на луната?": ["Аполо 11", "Аполо 9", "Аполо 10", "Аполо 12"]},
    "8": {"Кога е създадена ООН?": ["през 1945", "през 1954", "през 1952", "през 1942"]},
    "9": {"Как се нарича процесът на равномерно разпределение на веществата в околната среда?": ["дифузия", "асимилация"],
        "Кой период не е през палеозоя?": [ "Креда", "Карбон","Камбрий", "Силур"]},
    "10": {"Кога е роден Чарлз Дарвин?": ["1809", "1912", "1820", "1808"]},
    "11": {"Кой от следните артисти не участва във филма \"Еволюция\"?": ["Стивън Кълп", "Дейвид Духовни", "Шон Уилиям", "Айван Райтман"]},
    "12": {"Кой от ученицете тръгва след Иисус когато го вижда да ходи по водата?": ["Петър", "Йоан", "Матей", "Филип"]},
    "13": {"Как се нарича най-чистата храна според Йога?": ["сатвична", "раджастична", "тамасична", "кадалична"]},
    "14": {"Лъвът и тигъра произхождат от: ": ["смилобона", "палемастодона", "мамута", "кофосетуса"]},
    "15": {"В кое евангелие е описано как учениците на Иисус го последват?": [ "Йоан", "Марк", "Матей", "Лука"]}
}
